In [51]:
import pandas as pd

# Series

In [52]:
data = [1, 2, 3, 4, 5]

In [53]:
# criando uma Series com a pandas
s = pd.Series(data)

In [54]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [55]:
# criando index
indice = ['Linha' + str(i) for i in range(5)]

In [56]:
indice

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [57]:
# atribuindo à variável
s = pd.Series(data, index = indice)

In [58]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [59]:
# criando Series a partir de um dict
dados = {'Linha' + str(i) : i + 1 for i in range(5)}

In [60]:
dados

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [61]:
# a partir do dict
s1 = pd.Series(dados)
s1

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [62]:
s2 = s1 + 2

In [63]:
s2

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [64]:
# podemos fazer operação com as Series de mesmo índice
s3 = s2 + s1
s3

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [65]:
d1 = [[1, 2, 3],
      [4, 5, 6],
      [7, 8, 9]]

In [66]:
d1

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [67]:
# criando DataFrame a partir da lista
df = pd.DataFrame(d1)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [68]:
# criando index paras linhas
ind = ['Linha' + str(i) for i in range(3)]
ind

['Linha0', 'Linha1', 'Linha2']

In [69]:
df = pd.DataFrame(d1, index = ind)

In [70]:
df

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [71]:
# criando index paras colunas
ind1 = ['Coluna' + str(i) for i in range(3)]
ind1

['Coluna0', 'Coluna1', 'Coluna2']

In [72]:
df = pd.DataFrame(d1, index = ind, columns = ind1)
df

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [73]:
# criando DataFrame a partir de dict
data1 = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [74]:
data1

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [75]:
df1 = pd.DataFrame(data1)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [76]:
# criando DF a partir de tuplas
d2 = [(1, 2, 3),
      (4, 5, 6),
      (7, 8, 9)]
d2

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [77]:
df2 = pd.DataFrame(d2, index = ind, columns = ind1)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [78]:
df[df > 0] = 'A'
df

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [79]:
df1[df1 > 0] = 'B'
df1

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [80]:
df2[df2 > 0] = 'C'
df2

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [81]:
# concatenando a partir das COLUNAS
df4 = pd.concat([df, df1, df2])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [82]:
# concatenando a partir das LINHAS
df5 = pd.concat([df, df1, df2], axis = 1)
df5

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C